import streamlit as st
import streamlit_antd_components as sac

st.markdown("""
<style>
body, html {
    direction: RTL;
    unicode-bidi: bidi-override;
    text-align: right;
}

</style>

### הסבר לניסוי – השפעת פרסונליזציה על מודלי שפה גדולים (LLM)

שלום וברוכים הבאים,  
תודה על הסכמתכם להשתתף בניסוי שבודק את ההשפעה של פרסונליזציה על חוויית השימוש במודלי שפה גדולים (Large Language Models).

הניסוי כולל שלושה שלבים:

1. **בחירת תחומי עניין** – בשלב זה תתבקשו לבחור מספר נושאים שמעניינים אתכם, ולאחר מכן לבחור מספר חשבונות ברשתות חברתיות הקשורים לאותם נושאים – כאלה שהייתם שמחים לעקוב אחריהם.  
2. **שיחה עם מודל שפה** – לאחר מכן תתבקשו לנהל שיחה עם מודל שפה גדול, הכוללת לפחות כמה הודעות. במהלך השיחה אתם מוזמנים להתנסות במגוון אינטראקציות, כמו בקשת המלצה, חיפוש פריט מידע, או סתם שיחת חולין.  
3. **משוב על החוויה** – בסיום השיחה תתבקשו למלא שאלון קצר, הכולל 7 שאלות דירוג בסולם של 1 עד 5, במטרה להעריך את החוויה שלכם בממשק עם המודל.

ההשתתפות בניסוי היא אנונימית, והנתונים שייאספו ישמשו למטרות מחקר בלבד.

#### הניסוי יערך בשפה האנגלית

**תודה רבה על שיתוף הפעולה וההשתתפות!**
""", unsafe_allow_html=True)

next_button = sac.buttons([
    sac.ButtonsItem(label='התחל', color='#25C3B0', icon="caret-right")
], label="", index=None, color='violet', variant='filled')

if next_button == "התחל":
    st.session_state['clear_messages'] = True
    st.switch_page('pages/cold_start.py')